# SQL Querying in SQLite

> The purpose of this Jupyter notebook is setting up a connection to your database file (.db) and querying it using SQL.

### Import Libraries

In [1]:
import sqlite3 as sql
import pandas as pd
import numpy as np

### Make the Connection to your data set

In [2]:
# Create a variable to the name of your data set, which should be in the same folder
# as this notebook

database = 'cities.db'

In [3]:
# Make the connection. 

connection = sql.connect(database)

### Create Your Query

In [5]:
sql_query = '''SELECT * FROM city'''

### Create a data frame that takes 2 inputs, your database connection and the query

In [6]:
df = pd.read_sql_query(sql_query, connection)

### Let's see if this works.

In [7]:
df.head(10)

          name  population
0      Abilene      115930
1        Akron      217074
2       Albany       93994
3  Albuquerque      448607
4   Alexandria      128283
5    Allentown      106632
6     Amarillo      173627
7      Anaheim      328014
8    Anchorage      260283
9    Ann Arbor      114024

### Use the following template for querying

sql_query = '''
SELECT 
FROM 
'''

pd.read_sql_query(sql_query, connection)

### Find the top 10 cities with the greatest population

In [8]:
sql_query = '''
SELECT name, population
FROM city
ORDER BY population DESC
LIMIT 10;
'''

df2 = pd.read_sql_query(sql_query, connection)
df2

           name  population
0      New York     8008278
1   Los Angeles     3694820
2       Chicago     2896016
3       Houston     1953631
4  Philadelphia     1517550
5       Phoenix     1321045
6     San Diego     1223400
7        Dallas     1188580
8   San Antonio     1144646
9       Detroit      951270

### Export your Query to Excel or CSV

In [9]:
df2.to_csv('top10_cities.csv', index=False)